saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC800_DFP.1.10.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>LPC800_DFP</name>
  <description>NXP LPC800 Series Device Support</description>

  <releases>
    <release version="1.10.0" date="2018-07-30" deprecated="2018-07-30" replacement="Keil.LPC8N04_DFP">
      The device support for these devices is now provided by NXP with the only exception of the LPC8N04 series:
      - Keil.LPC8N04_DFP.1.0.0.pack
    </release>
    <release version="1.9.0" date="2018-05-18">
      Note: Pack is not backward campatible, to pack 1.7.0, because of changed and renamed header files!
      Updated LPC8N04 device support files.
      Updated LPC80x device support files.
      Updated LPC83x device support files.
      Updated documentation.
    </release>
    <release version="1.8.0" date="2018-04-18">
      Updated LPC800 device support files.
      Updated documentation.
      Reworked examples.
      Updated LPC84x SVD file.
    </release>
    <release version="1.7.0" date="2018-01-11">
      Added LPC804 and LPC8N04 device support.
    </release>
    <release version="1.6.0" date="2017-11-15">
      Added LPC802 device support.
      Updated device documentation.
      Updated debug sequences: When disabling 'Reset Vector Catch', use read modify write operation on updating DEMCR_Addr to avoid side effects.
      Updated LPC84x-LPCXpresso RTX5_Blinky example:
      - Re-added RAM target.
    </release>
    <release version="1.5.0" date="2017-05-23">
      Added LPC84x device support.
      Updated LPC84x SVD file.
      Updated documentation.
      Updated LPC84x-LPCXpresso RTX5_Blinky example:
      - Removed RAM target.
    </release>
    <release version="1.4.0" date="2016-10-04">
      Updated LPC83x SVD file.
    </release>
    <release version="1.3.0" date="2016-09-05">
      Added LPC83x device support.
      Updated documentation.
      Corrected doxy comments is system file.
    </release>
    <release version="1.2.0" date="2015-06-26">
      Updated LPC8xx.h fixing wrong address offset for IRQ_FLAG in struct LPC_MRT_TypeDef.
    </release>
    <release version="1.1.0" date="2014-10-13">
      Added LPC82x device support.
      Added Board description, examples for LPC824-Xpresso and LPC812-Xpresso development boards.
    </release>
    <release version="1.0.1">
      Updated: Device description with features
    </release>
    <release version="1.0.0">
      First Release version of LPC800 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>LPC800</keyword>
    <keyword>LPC8xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="LPC800 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <debugconfig default="swd" clock="5000000" swj="0"/>
      <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>

      <sequences>
        <!-- VectReset not available on CM0/CM0+ -->
        <sequence name="ResetProcessor" disable="true"/>
      </sequences>

      <!-- ************************  Subfamily 'LPC802'  **************************** -->
      <subFamily DsubFamily="LPC802">
        <processor Dclock="15000000"/>

        <book name="Documents/UM11045.pdf" title="LPC802 User manual"/>
        <book name="Documents/LPC802.pdf"  title="LPC802 Datasheet"/>
        <description>
The LPC802 are an ARM Cortex-M0+ based, low-cost 32-bit MCU family operating at CPU frequencies of up to 15 MHz.
The LPC802 support up to 16 KB of flash memory and 2 KB of SRAM.
The peripheral complement of the LPC802 includes one I2C-bus interface, up to two USARTs, one SPI interface, one multi-rate timer, self-wake-up timer, one general purpose 32-bit counter/timer, one 12-bit ADC, one analog comparator, function-configurable I/O ports through a switch matrix, and up to 17 general-purpose I/O pins.
        </description>

        <!--
             On LPC802 bootloader must run to initialize the flash trim register.
             Without initialized flash trim register flash program/erase won’t work.
             Follwing seequences shall ensure thet the bootloader has run.
          -->
        <sequences>
<!-- Reset Stuff -->
          <sequence name="ForceCoreHalt">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              __var DCRSR_Addr = SCS_Addr + 0xDF4;
              __var DCRDR_Addr = SCS_Addr + 0xDF8;
              __var DHCSR_Val  = 0;
            </block>

            <!-- wait until core has stopped or run in timeout -->
            <control while="((DHCSR_Val = Read32(DHCSR_Addr)) &amp; 0x00020000) == 0" timeout="100000"/>

            <!-- if core has not stopped force halt -->
            <control if="(DHCSR_Val &amp; 0x00020000) == 0">
              <block info="Halt core">
                Write32(DHCSR_Addr,0xA05F0003);                                  // halt core
              </block>

              <!-- wait until core has stopped -->
              <control while="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0" timeout="1000"/>
            </control>
          </sequence>

          <sequence name="ResetSystem"    info="SYSRESETREQ">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;

              __errorcontrol = 1;                                              // ignore errors
              Write32(AIRCR_Addr, 0x05FA0004);                                 // Execute SYSRESETREQ via AIRCR
              __errorcontrol = 0;                                              // check errors

              DAP_Delay(1000);                                                 // time for reset
            </block>

            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) == 0" timeout="100000"/>

            <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
          </sequence>

          <sequence name="ResetProcessor" info="VECTRESET">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;

