saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC800_DFP.1.10.0.pdsc
              __errorcontrol = 1;                                              // ignore errors
              Write32(AIRCR_Addr, 0x05FA0001);                                 // Execute VECTRESET via AIRCR
              __errorcontrol = 0;                                              // check errors
            </block>

            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) == 0" timeout="100000"/>

            <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
          </sequence>

          <sequence name="ResetHardware"  info="HW RESET">
            <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;

              canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);     // Deassert nRESET line
            </block>

            <!-- Keep reset active for 50 ms -->
            <control while="1" timeout="50000"/>

            <control if="canReadPins">
              <!-- Assert nRESET line and wait max. 1s for recovery -->
              <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
            </control>

            <control if="!canReadPins">
              <block>
                DAP_SWJ_Pins(nReset, nReset, 0);                               // Assert nRESET line
              </block>

              <!-- Wait 100ms for recovery if nRESET not readable -->
              <control while="1" timeout="100000"/>
            </control>

            <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
          </sequence>
<!-- Reset Stuff -->

<!-- Stop After Bootloader -->
          <sequence name="ResetCatchSet">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var value      = 0;
              __var FPB_BKPT_H = 0x80000000;
              __var FPB_BKPT_L = 0x40000000;
              __var FPB_COMP_M = 0x1FFFFFFC;
              __var FPB_KEY    = 0x00000002;
              __var FPB_ENABLE = 0x00000001;
            </block>

            <!-- read reset vector from Flash -->
            <block>
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch in DEMCR
            </block>

            <!-- set BreakPoint regardless whether reset vector is valid or not -->
            <block>
              Write32(0x40048000, 0x00000002);                                 // Map Flash to Vectors
              value = Read32 (0x00000004);                                     // Read Reset Vector

              value = ((value &amp; 0x02) ? FPB_BKPT_H : FPB_BKPT_L) | (value &amp; FPB_COMP_M) | FPB_ENABLE ;
              Write32(0xE0002008, value);                                      // Set BP0 to Reset Vector
              Write32(0xE0002000, (FPB_KEY | FPB_ENABLE));                     // Enable FPB
            </block>

            <block>
              Read32(DHCSR_Addr);                                              // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
            </block>
          </sequence>

          <sequence name="ResetCatchClear">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var value      = 0;

              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch in DEMCR

              Write32(0xE0002008, 0x00000000);                                 // Clear BP0
              Write32(0xE0002000, 0x00000002);                                 // Disable FPB
            </block>
          </sequence>
<!-- Stop After Bootloader -->
        </sequences>

        <feature type="USART"         n="2"/>
        <feature type="I2C"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="ADC"           n="1"       m="12"  name="ADC"/>
        <feature type="WDT"           n="1"               name="Windowed Watchdog timer"/>
        <feature type="Timer"         n="4"               name="One 32-bit general purpose, two channel Multi-Rate, Self-Wake-up"/>
        <feature type="AnalogOther"   n="1"               name="Comparator"/>
        <feature type="CoreOther"     n="1"               name="CRC engine"/>
        <feature type="CoreOther"     n="1"               name="Unique device serial number"/>

        <!-- *************************  Device 'LPC802M001JDH16'  ***************************** -->
        <device Dname="LPC802M001JDH16">
          <compile header="Device/Include/LPC802.h"  define="LPC802M001JDH16"/>
          <debug svd="SVD/LPC802.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x10000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/LPC80x_16.FLM"  start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x07E0" default="1"/>

          <feature type="IOs"   n="13"/>
          <feature type="SOP"   n="16" name="TSSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC802M001JDH20'  ***************************** -->
        <device Dname="LPC802M001JDH20">
          <compile header="Device/Include/LPC802.h"  define="LPC802M001JDH20"/>
          <debug svd="SVD/LPC802.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x10000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/LPC80x_16.FLM"  start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x07E0" default="1"/>

          <feature type="IOs"   n="17"/>
          <feature type="SOP"   n="20" name="TSSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC802M011JDH20'  ***************************** -->
        <device Dname="LPC802M011JDH20">
          <compile header="Device/Include/LPC802.h"  define="LPC802M011JDH20"/>
          <debug svd="SVD/LPC802.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x10000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/LPC80x_16.FLM"  start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x07E0" default="1"/>

          <feature type="IOs"   n="16"/>
          <feature type="SOP"   n="20" name="TSSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC802M001JHI33'  ***************************** -->
        <device Dname="LPC802M001JHI33">
          <compile header="Device/Include/LPC802.h"  define="LPC802M001JHI33"/>
          <debug svd="SVD/LPC802.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x10000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/LPC80x_16.FLM"  start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x07E0" default="1"/>

