saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC800_DFP.1.10.0.pdsc
          <feature type="IOs"   n="25"/>
          <feature type="QFN"   n="33" name="HVQFN Package"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC804'  **************************** -->
      <subFamily DsubFamily="LPC804">
        <processor Dclock="15000000"/>

        <book name="Documents/UM11065.pdf" title="LPC804 User manual"/>
        <book name="Documents/LPC804.pdf"  title="LPC804 Datasheet"/>
        <description>
The LPC80x are an ARM Cortex-M0+ based, low-cost 32-bit MCU family operating at CPU frequencies of up to 15 MHz.
The LPC804 support up to 32 KB of flash memory and 4 KB of SRAM.
The peripheral complement of the LPC80x includes a CRC engine, two I2C-bus interfaces, two USARTs, one SPI interface, Capacitive Touch Interface (Cap Touch), one multi-rate timer, self-wake-up timer, one general purpose 32-bit counter/timer, one 12-bit ADC, one10-bit DAC, one analog comparator, function-configurable I/O ports through a switch matrix, an input pattern match engine, Programmable Logic Unit (PLU), and up to 30 general-purpose I/O pins.
        </description>

        <!--
             On LPC804 bootloader must run to initialize the flash trim register.
             Without initialized flash trim register flash program/erase won’t work.
             Follwing seequences shall ensure thet the bootloader has run.
          -->
        <sequences>
<!-- Reset Stuff -->
          <sequence name="ForceCoreHalt">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              __var DCRSR_Addr = SCS_Addr + 0xDF4;
              __var DCRDR_Addr = SCS_Addr + 0xDF8;
              __var DHCSR_Val  = 0;
            </block>

            <!-- wait until core has stopped or run in timeout -->
            <control while="((DHCSR_Val = Read32(DHCSR_Addr)) &amp; 0x00020000) == 0" timeout="100000"/>

            <!-- if core has not stopped force halt -->
            <control if="(DHCSR_Val &amp; 0x00020000) == 0">
              <block info="Halt core">
                Write32(DHCSR_Addr,0xA05F0003);                                  // halt core
              </block>

              <!-- wait until core has stopped -->
              <control while="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0" timeout="1000"/>
            </control>
          </sequence>

          <sequence name="ResetSystem"    info="SYSRESETREQ">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;

              __errorcontrol = 1;                                              // ignore errors
              Write32(AIRCR_Addr, 0x05FA0004);                                 // Execute SYSRESETREQ via AIRCR
              __errorcontrol = 0;                                              // check errors

              DAP_Delay(1000);                                                 // time for reset
            </block>

            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) == 0" timeout="100000"/>

            <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
          </sequence>

          <sequence name="ResetProcessor" info="VECTRESET">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;

              __errorcontrol = 1;                                              // ignore errors
              Write32(AIRCR_Addr, 0x05FA0001);                                 // Execute VECTRESET via AIRCR
              __errorcontrol = 0;                                              // check errors
            </block>

            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) == 0" timeout="100000"/>

            <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
          </sequence>

          <sequence name="ResetHardware"  info="HW RESET">
            <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;

              canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);     // Deassert nRESET line
            </block>

            <!-- Keep reset active for 50 ms -->
            <control while="1" timeout="50000"/>

            <control if="canReadPins">
              <!-- Assert nRESET line and wait max. 1s for recovery -->
              <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
            </control>

            <control if="!canReadPins">
              <block>
                DAP_SWJ_Pins(nReset, nReset, 0);                               // Assert nRESET line
              </block>

              <!-- Wait 100ms for recovery if nRESET not readable -->
              <control while="1" timeout="100000"/>
            </control>

            <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
          </sequence>
<!-- Reset Stuff -->

<!-- Stop After Bootloader -->
          <sequence name="ResetCatchSet">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var value      = 0;
              __var FPB_BKPT_H = 0x80000000;
              __var FPB_BKPT_L = 0x40000000;
              __var FPB_COMP_M = 0x1FFFFFFC;
              __var FPB_KEY    = 0x00000002;
              __var FPB_ENABLE = 0x00000001;
            </block>

            <!-- read reset vector from Flash -->
            <block>
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch in DEMCR
            </block>

