saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC800_DFP.1.10.0.pdsc
          <feature type="IOs"           n="29"/>
          <feature type="QFN"           n="33"        name="QFN Package"/>
        </device>

        <!-- *************************  Device 'LPC832M101FDH20'  ***************************** -->
        <device Dname="LPC832M101FDH20">
          <compile header="Device/Include/LPC83x.h" define="LPC832M101FDH20"/>
          <debug svd="SVD/LPC83x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_16.FLM" start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

          <feature type="IOs"           n="16"/>
          <feature type="SOP"           n="20"        name="SSOP Package"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC84x'  **************************** -->
      <subFamily DsubFamily="LPC84x">
        <processor Dclock="30000000"/>

        <book name="Documents/UM11029.pdf" title="LPC84x User manual"/>
        <book name="Documents/LPC84x.pdf"  title="LPC84x Datasheet"/>
        <description>
The LPC84x are an ARM Cortex-M0+ based, low-cost 32-bit MCU family operating at CPU frequencies of up to 30 MHz.
The LPC84x support up to 64 KB of flash memory and 16 KB of SRAM.
The peripheral complement of the LPC84x includes a CRC engine, four I2C-bus interfaces, up to five USARTs, up to two SPI interfaces, Capacitive Touch Interface (CAPT), one multi-rate timer, self-wake-up timer, SCTimer/PWM, one general purpose 32-bit counter/timer, a DMA, one 12-bit ADC, two 10-bit DACs, one analog comparator, function-configurable I/O ports through a switch matrix, an input pattern match engine, and up to 54 general-purpose I/O pins.
        </description>

        <debugvars configfile="Debug/LPC84x.dbgconf">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var Dbg_CR                = 0x00000000;                            // DBG_CR
        </debugvars>

        <sequences>
          <sequence name="DebugDeviceUnlock">
            <block>
              __var value = 0;

              value  = Read32(0x40048080);                                     // Read SYSAHBCLKCTRL0
              value |= (1 &lt;&lt; 26);                                        // Enable MTB Control Register Clock
              Write32(0x40048080, value);                                      // Write modified value to SYSAHBCLKCTRL0
            </block>
          </sequence>

          <!-- ResetCatchSet Sequence LPC84x -->
          <sequence name="ResetCatchSet">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var value      = 0;
              __var FPB_BKPT_H = 0x80000000;
              __var FPB_BKPT_L = 0x40000000;
              __var FPB_COMP_M = 0x1FFFFFFC;
              __var FPB_KEY    = 0x00000002;
              __var FPB_ENABLE = 0x00000001;
            </block>

            <control if="Dbg_CR == 0x00000000" info="Stop after bootloader disabled">
              <block>
                value = Read32(DEMCR_Addr);
                Write32(DEMCR_Addr, (value | 0x00000001));                     // Enable Reset Vector Catch in DEMCR
              </block>
            </control>

            <control if="Dbg_CR == 0x00000001" info="Stop after bootloader enabled">
              <block>
                value = Read32(DEMCR_Addr);
                Write32(DEMCR_Addr, (value &amp; (~0x00000001)));              // Disable Reset Vector Catch in DEMCR
              </block>

              <control if="value &lt; 0x20000000" info="Set and enable breakpoint">
                <block>
                  Write32(0x40048000, 0x00000002);                             // Map Flash to Vectors
                  value = Read32 (0x00000004);                                 // Read Reset Vector

                  value = ((value &amp; 0x02) ? FPB_BKPT_H : FPB_BKPT_L) | (value &amp; FPB_COMP_M) | FPB_ENABLE ;
                  Write32(0xE0002008, value);                                  // Set BP0 to Reset Vector
                  Write32(0xE0002000, (FPB_KEY | FPB_ENABLE));                 // Enable FPB
                </block>
              </control>

              <control if="value &gt;= 0x20000000" info="Enable reset vector catch">
                <block>
                  value = Read32(DEMCR_Addr);
                  Write32(DEMCR_Addr, (value | 0x00000001));                   // Enable Reset Vector Catch in DEMCR
                </block>
              </control>
            </control>

            <block>
              Read32(DHCSR_Addr);                                              // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
            </block>
          </sequence>

          <!-- ResetCatchClear Sequence LPC84x -->
          <sequence name="ResetCatchClear">
            <block>
              // System Control Space (SCS) offset as defined in ARMv6-M/ARMv7-M.
              // Reimplement this sequence if the SCS is located at a different offset.
              __var SCS_Addr   = 0xE000E000;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var value      = 0;

              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch in DEMCR

              Write32(0xE0002008, 0);                                          // Clear BP0
              Write32(0xE0002000, 0x00000002);                                 // Disable FPB
            </block>
          </sequence>
        </sequences>

        <feature type="SPI"           n="2"/>
        <feature type="WDT"           n="1"                           name="Windowed Watchdog timer"/>
        <feature type="Timer"         n="4"                           name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
        <feature type="ADC"           n="1"       m="12"/>
        <feature type="CoreOther"     n="1"                           name="CRC engine"/>
        <feature type="CoreOther"     n="1"                           name="Unique device serial number"/>

