saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC800_DFP.1.10.0.pdsc
    <condition id="LPC8N04 CMSIS">
      <description>NXP LPC8N04 Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC8N04*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC810 CMSIS">
      <description>NXP LPC810 Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC810*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="LPC811 CMSIS">
      <description>NXP LPC811 Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC811*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="LPC812 CMSIS">
      <description>NXP LPC812 Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC812*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC822 CMSIS">
      <description>NXP LPC822 Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC822*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="LPC824 CMSIS">
      <description>NXP LPC824 Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC824*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC83x CMSIS">
      <description>NXP LPC83x Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC83*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC844 CMSIS">
      <description>NXP LPC844 Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC844*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="LPC845 CMSIS">
      <description>NXP LPC845 Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC845*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup LPC802 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC802 CMSIS">
      <description>System Startup for NXP LPC802 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC802.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC802.c"      attr="config" version="1.1.0"/>
      </files>
    </component>

    <!-- Startup LPC804 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC804 CMSIS">
      <description>System Startup for NXP LPC804 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC804.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC804.c"      attr="config" version="1.1.0"/>
      </files>
    </component>

    <!-- Startup LPC8N04 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC8N04 CMSIS">
      <description>System Startup for NXP LPC8N04 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC8N04.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC8N04.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC810 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC810 CMSIS">
      <description>System Startup for NXP LPC810 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC810.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC810.c"      attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup LPC811 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC811 CMSIS">
      <description>System Startup for NXP LPC811 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC811.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC811.c"      attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup LPC812 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC812 CMSIS">
      <description>System Startup for NXP LPC812 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC812.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC812.c"      attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup LPC822 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC822 CMSIS">
      <description>System Startup for NXP LPC822 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC822.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC822.c"      attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup LPC824 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC824 CMSIS">
      <description>System Startup for NXP LPC824 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC824.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC824.c"      attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup LPC83x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC83x CMSIS">
      <description>System Startup for NXP LPC83x Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC83x.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC83x.c"      attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup LPC844 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC844 CMSIS">
      <description>System Startup for NXP LPC844 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC844.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC844.c"      attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup LPC845 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="LPC845 CMSIS">
      <description>System Startup for NXP LPC845 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC845.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC845.c"      attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- LPC812 LPCXpresso Board Support -->
    <bundle Cbundle="LPC812 LPCXpresso" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPC812 LPCXpresso Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="LPC812 CMSIS">
      <description>LED driver for NXP LPC812 LPCXpresso Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPC812-LPCXpresso/Common/LED_LPC812-LPCXpresso.c"/>
        </files>
      </component>
      <component Cgroup="Comparator" condition="LPC812 CMSIS">
      <description>Comparator driver for NXP LPC812 LPCXpresso Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPC812-LPCXpresso/Common/Comparator_LPC812-LPCXpresso.c"/>
          <file category="header" name="Boards/NXP/LPC812-LPCXpresso/Common/Comparator_LPC812-LPCXpresso.h"/>
        </files>
      </component>
    </bundle>

    <!-- LPC824 LPCXpresso Board Support -->
    <bundle Cbundle="LPCXpresso824-MAX" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPCXpresso824-MAX Board</description>
      <doc></doc>
      <component Cgroup="LED"     Capiversion="1.0.0" condition="LPC824 CMSIS">
      <description>LED driver for LPCXpresso824-MAX Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso824-MAX/Common/LED_LPCXpresso824-MAX.c"/>
        </files>
      </component>
